# Напишите функцию,вычисляющию сумму элементов списка целых.Список передаётся в качестве параметра.

import random
def print_sum(n):
    print("Введите размер списка" )
n=int(input("k"))
m=[7]
for i in range(n):
    print(random.randint(-5,17), end='')

print(print_sum(n))